{
  "Common": {
    "language": {
      "fa": "فارسی",
      "en": "English"
    },
    "switch": "Switch language"
  },
  "HomePage": {
    "name": "Portfolio",
    "portfolio": "Mostafa Kamari",
    "projects": "Projects",
    "contact": "Contact Me",
    "desc": "Junior Frontend Developer",
    "desctwo": "Building fast, scalable, and user-focused web applications"
  },
  "AboutMe": {
    "skills": "Skills",
    "aboutme": "About Me",
    "contact": "Contact Me",
    "download": "Download Resume",
    "aboutmefull": "I am Mostafa Kamari, born on March 5, 2000. From an early age, I have had a strong interest in technology and computers, an interest that shaped my educational and professional path in this field.\nI am deeply passionate about designing and developing new products, especially in graphic-related areas such as UI design and creating engaging user experiences. Designing and building a website from scratch and seeing a result that perfectly matches my ideas has always been inspiring and deeply satisfying for me.\nOne of my strongest personal traits is an endless desire to learn. I am constantly seeking new challenges and strive to improve my skills and grow continuously by solving complex problems.\nI have a strong passion for turning ideas in my mind into reality through coding. This interest has driven me to consistently learn various tools and technologies in the fields of web design and software development.\nMy diverse professional experiences have taught me that creativity, when combined with discipline and precise planning, can lead to remarkable achievements. For this reason, I always aim to complete my projects with maximum accuracy, high quality, and full focus.\nI am also highly interested in teamwork, as I believe that the combination of ideas and collective effort leads to the best results.\nI hope to continue this journey by gaining more knowledge and experience and to contribute to the creation of impactful and meaningful achievements.\nIf you would like to get in touch or discuss collaboration opportunities and new projects, I would be happy to hear from you."
  },
  "Contact": {
    "contactme": "Contact Me",
    "contactone": "If you have any collaboration proposals, I’d be happy to hear them! I’d love to talk about your ideas, projects, and front-end needs. If you’re looking to build a fast, modern, and visually appealing website — or need someone to bring your designs and ideas to life — I’m here!",
    "contacttwo": "Contact me — let’s create something together that’s truly worth seeing.",
    "social": "Social Media",
    "sendms": "Send Message",
    "name": "Full Name",
    "email": "Your Email",
    "description": "Your Message",
    "character": "characters",
    "send": "Send",
    "sending": "Sending...",
    "success": "Message sent successfully!"
  },
  "Projects": {
    "projects": "Projects",
    "desc": "All projects include the technologies used, libraries, descriptions, challenges, images, GitHub repository links, and website links in their information section.",
    "notfound": "No projects found",
    "moreprojects": "Keep scrolling to discover more projects",
    "rep": "Repository",
    "view": "View Site",
    "more": "More",
    "close": "Close",
    "moreinfo": "Click on ‘More’ to see the full project details",
    "notopen": "You haven’t opened the project yet",
    "about": "About the Project",
    "techs": "Libraries & Technologies",
    "chall": "Challenges",
    "info": "Project Information"
  },
  "NotFound": {
    "title": "Page Not Found",
    "message": "Sorry, the page you are looking for does not exist.",
    "home": "Go to Home"
  }
}
